EmbeddedKing/ATmega16/atmega16_io/atmega16_io.c
#include "atmega16_io.h"

/************************************************************************/
/*void	IO_Init();														*/
/*																		*/
/*此函数用来初始化IO，有一个参数										    */
/*一.port：用来选择IO端口													*/
/*																		*/
/************************************************************************/

void IO_Init(Port_Type port)
{
	switch (port)
	{
		case PORT_A:
			DDRA = 0xff;
			PORTA = 0x00;
			break;
		case PORT_B:
			DDRB = 0xff;
			PORTB = 0x00;
			break;
		case PORT_C:
			DDRC = 0xff;
			PORTC = 0x00;
			break;
		case PORT_D:
			DDRC = 0xff;
			PORTC = 0x00;
			break;
	}
}

/************************************************************************/
/*void	IO_PinMode();													*/
/*																		*/
/*此函数用来设置引脚模式，有三个参数									    */
/*一.pin：用来选择引脚													*/
/*一.pincmd：用来设置输入输出												*/
/*一.pinres：用来设置高低电平												*/
/*																		*/
/************************************************************************/

void IO_PinMode(Pin_Type pin , PinCmd_Type pincmd , PinRes_Type pinres)
{
	
	//PA0的设置
	if(pin==PORTA_Pin_0)
	{
		if ((pincmd==Input) && (pinres==High))		//PA0输入,引脚默认高电平
		{
			DDRA&=~(1<<PORTA0);				//PA0输入
			PORTA|=(1<<PORTA0);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PA0输入，引脚默认低电平
		{
			DDRA&=~(1<<PORTA0);				//PA0输入
			PORTA&=~(1<<PORTA0);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PA0输出，引脚默认高电平
		{
			DDRA|=(1<<PORTA0);				//PA0输出
			PORTA|=(1<<PORTA0);				//上拉电阻使能
		}
		
		else if ((pincmd==Output) && (pinres==Low))
		{
			DDRA|=(1<<PORTA0);				//PA0输出
			PORTA&=~(1<<PORTA0);			//上拉电阻禁止
		}
	}
	
	//PA1的设置
	
	else if(pin==PORTA_Pin_1)
	{
		if ((pincmd==Input) && (pinres==High))		//PA1输入,引脚默认高电平
		{
			DDRA&=~(1<<PORTA1);				//PA1输入
			PORTA|=(1<<PORTA1);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PA1输入，引脚默认低电平
		{
			DDRA&=~(1<<PORTA1);				//PA1输入
			PORTA&=~(1<<PORTA1);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PA1输出，引脚默认高电平
		{
			DDRA|=(1<<PORTA1);				//PA1输出
			PORTA|=(1<<PORTA1);				//上拉电阻使能
		}
		
		else if ((pincmd==Output) && (pinres==Low))
		{
			DDRA|=(1<<PORTA1);				//PA1输出
			PORTA&=~(1<<PORTA1);			//上拉电阻禁止
		}
	}
	
	//PA2的设置
	
	else if(pin==PORTA_Pin_2)
	{
		if ((pincmd==Input) && (pinres==High))		//PA2输入,引脚默认高电平
		{
			DDRA&=~(1<<PORTA2);				//PA2输入
			PORTA|=(1<<PORTA2);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PA2输入，引脚默认低电平
		{
			DDRA&=~(1<<PORTA2);				//PA2输入
			PORTA&=~(1<<PORTA2);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PA2输出，引脚默认高电平
		{
			DDRA|=(1<<PORTA2);				//PA2输出
			PORTA|=(1<<PORTA2);				//上拉电阻使能
		}
		
		else if ((pincmd==Output) && (pinres==Low))
		{
			DDRA|=(1<<PORTA2);				//PA2输出
			PORTA&=~(1<<PORTA2);			//上拉电阻禁止
		}
	}
	
	//PA3的设置
	
	else if(pin==PORTA_Pin_3)
	{
		if ((pincmd==Input) && (pinres==High))		//PA3输入,引脚默认高电平
		{
			DDRA&=~(1<<PORTA3);				//PA3输入
			PORTA|=(1<<PORTA3);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PA3输入，引脚默认低电平
		{
			DDRA&=~(1<<PORTA3);				//PA3输入
			PORTA&=~(1<<PORTA3);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PA3输出，引脚默认高电平
		{
			DDRA|=(1<<PORTA3);				//PA3输出
			PORTA|=(1<<PORTA3);				//上拉电阻使能
		}
		
		else if ((pincmd==Output) && (pinres==Low))
		{
			DDRA|=(1<<PORTA3);				//PA3输出
			PORTA&=~(1<<PORTA3);			//上拉电阻禁止
		}
	}
	
	//PA4的设置
	
	else if(pin==PORTA_Pin_4)
	{
		if ((pincmd==Input) && (pinres==High))		//PA4输入,引脚默认高电平
		{
			DDRA&=~(1<<PORTA4);				//PA4输入
			PORTA|=(1<<PORTA4);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PA4输入，引脚默认低电平
		{
			DDRA&=~(1<<PORTA4);				//PA4输入
			PORTA&=~(1<<PORTA4);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PA4输出，引脚默认高电平
		{
			DDRA|=(1<<PORTA4);				//PA4输出
			PORTA|=(1<<PORTA4);				//上拉电阻使能
		}
		
		else if((pincmd==Output) && (pinres==Low))
		{
			DDRA|=(1<<PORTA4);				//PA4输出
			PORTA&=~(1<<PORTA4);			//上拉电阻禁止
		}
	}
	
	//PA5的设置
	
	else if(pin==PORTA_Pin_5)
	{
		if ((pincmd==Input) && (pinres==High))		//PA5输入,引脚默认高电平
		{
			DDRA&=~(1<<PORTA5);				//PA5输入
			PORTA|=(1<<PORTA5);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PA5输入，引脚默认低电平
		{
			DDRA&=~(1<<PORTA5);				//PA5输入
			PORTA&=~(1<<PORTA5);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PA5输出，引脚默认高电平
		{
			DDRA|=(1<<PORTA5);				//PA5输出
			PORTA|=(1<<PORTA5);				//上拉电阻使能
		}
		
		else if((pincmd==Output) && (pinres==Low))
		{
			DDRA|=(1<<PORTA5);				//PA5输出
			PORTA&=~(1<<PORTA5);			//上拉电阻禁止
		}
	}
	
	//PA6的设置
	
	else if(pin==PORTA_Pin_6)
	{
		if ((pincmd==Input) && (pinres==High))		//PA6输入,引脚默认高电平
		{
			DDRA&=~(1<<PORTA6);				//PA6输入
			PORTA|=(1<<PORTA6);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PA6输入，引脚默认低电平
		{
			DDRA&=~(1<<PORTA6);				//PA6输入
			PORTA&=~(1<<PORTA6);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PA6输出，引脚默认高电平
		{
			DDRA|=(1<<PORTA6);				//PA6输出
			PORTA|=(1<<PORTA6);				//上拉电阻使能
		}
		
		else if((pincmd==Output) && (pinres==Low))
		{
			DDRA|=(1<<PORTA6);				//PA6输出
			PORTA&=~(1<<PORTA6);			//上拉电阻禁止
		}
	}
	
	//PA7的设置
	
	else if(pin==PORTA_Pin_7)
	{
		if ((pincmd==Input) && (pinres==High))		//PA7输入,引脚默认高电平
		{
			DDRA&=~(1<<PORTA7);				//PA7输入
			PORTA|=(1<<PORTA7);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PA7输入，引脚默认低电平
		{
			DDRA&=~(1<<PORTA7);				//PA7输入
			PORTA&=~(1<<PORTA7);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PA7输出，引脚默认高电平
		{
			DDRA|=(1<<PORTA7);				//PA7输出
			PORTA|=(1<<PORTA7);				//上拉电阻使能
		}
		
		else if((pincmd==Output) && (pinres==Low))
		{
			DDRA|=(1<<PORTA7);				//PA7输出
			PORTA&=~(1<<PORTA7);			//上拉电阻禁止
		}
	}
	
	//PB0的设置
	
	else if(pin==PORTB_Pin_0)
	{
		if ((pincmd==Input) && (pinres==High))		//PB0输入,引脚默认高电平
		{
			DDRB&=~(1<<PORTB0);				//PB0输入
			PORTB|=(1<<PORTB0);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PB0输入，引脚默认低电平
		{
			DDRB&=~(1<<PORTB0);				//PB0输入
			PORTB&=~(1<<PORTB0);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PB0输出，引脚默认高电平
		{
			DDRB|=(1<<PORTB0);				//PB0输出
			PORTB|=(1<<PORTB0);				//上拉电阻使能
		}
		
