EmbeddedKing/ATmega16/atmega16_io/atmega16_io.c
		else if((pincmd==Output) && (pinres==Low))
		{
			DDRB|=(1<<PORTB0);				//PB0输出
			PORTB&=~(1<<PORTB0);			//上拉电阻禁止
		}
	}
	
	//PB1的设置
	
	else if(pin==PORTB_Pin_1)
	{
		if ((pincmd==Input) && (pinres==High))		//PB1输入,引脚默认高电平
		{
			DDRB&=~(1<<PORTB1);				//PB1输入
			PORTB|=(1<<PORTB1);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PB1输入，引脚默认低电平
		{
			DDRB&=~(1<<PORTB1);				//PB1输入
			PORTB&=~(1<<PORTB1);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PB1输出，引脚默认高电平
		{
			DDRB|=(1<<PORTB1);				//PB1输出
			PORTB|=(1<<PORTB1);				//上拉电阻使能
		}
		
		else if((pincmd==Output) && (pinres==Low))
		{
			DDRB|=(1<<PORTB1);				//PB1输出
			PORTB&=~(1<<PORTB1);			//上拉电阻禁止
		}
	}
	
	//PB2的设置
	
	else if(pin==PORTB_Pin_2)
	{
		if ((pincmd==Input) && (pinres==High))		//PB2输入,引脚默认高电平
		{
			DDRB&=~(1<<PORTB2);				//PA0输入
			PORTB|=(1<<PORTB2);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PB2输入，引脚默认低电平
		{
			DDRB&=~(1<<PORTB2);				//PB2输入
			PORTB&=~(1<<PORTB2);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PB2输出，引脚默认高电平
		{
			DDRB|=(1<<PORTB2);				//PB2输出
			PORTB|=(1<<PORTB2);				//上拉电阻使能
		}
		
		else if((pincmd==Output) && (pinres==Low))
		{
			DDRB|=(1<<PORTB2);				//PB2输出
			PORTB&=~(1<<PORTB2);			//上拉电阻禁止
		}
	}
	
	//PB3的设置
	
	else if(pin==PORTB_Pin_3)
	{
		if ((pincmd==Input) && (pinres==High))		//PB3输入,引脚默认高电平
		{
			DDRB&=~(1<<PORTB3);				//PB3输入
			PORTB|=(1<<PORTB3);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PB3输入，引脚默认低电平
		{
			DDRB&=~(1<<PORTB3);				//PB3输入
			PORTB&=~(1<<PORTB3);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PB3输出，引脚默认高电平
		{
			DDRB|=(1<<PORTB3);				//PB3输出
			PORTB|=(1<<PORTB3);				//上拉电阻使能
		}
		
		else if((pincmd==Output) && (pinres==Low))
		{
			DDRB|=(1<<PORTB3);				//PB3输出
			PORTB&=~(1<<PORTB3);			//上拉电阻禁止
		}
	}
	
	//PB4的设置
	
	else if(pin==PORTB_Pin_4)
	{
		if ((pincmd==Input) && (pinres==High))		//PA0输入,引脚默认高电平
		{
			DDRB&=~(1<<PORTB4);				//PA0输入
			PORTB|=(1<<PORTB4);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PA0输入，引脚默认低电平
		{
			DDRB&=~(1<<PORTB4);				//PA0输入
			PORTB&=~(1<<PORTB4);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PA0输出，引脚默认高电平
		{
			DDRB|=(1<<PORTB4);				//PA0输出
			PORTB|=(1<<PORTB4);				//上拉电阻使能
		}
		
		else if((pincmd==Output) && (pinres==Low))
		{
			DDRB|=(1<<PORTB4);				//PA0输出
			PORTB&=~(1<<PORTB4);			//上拉电阻禁止
		}
	}
	
	//PB5的设置
	
	else if(pin==PORTB_Pin_5)
	{
		if ((pincmd==Input) && (pinres==High))		//PB5输入,引脚默认高电平
		{
			DDRB&=~(1<<PORTB5);				//PA0输入
			PORTB|=(1<<PORTB5);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PB5输入，引脚默认低电平
		{
			DDRB&=~(1<<PORTB5);				//PB5输入
			PORTB&=~(1<<PORTB5);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PB5输出，引脚默认高电平
		{
			DDRB|=(1<<PORTB5);				//PB5输出
			PORTB|=(1<<PORTB5);				//上拉电阻使能
		}
		
		else if((pincmd==Output) && (pinres==Low))
		{
			DDRB|=(1<<PORTB5);				//PB5输出
			PORTB&=~(1<<PORTB5);			//上拉电阻禁止
		}
	}
	
	//PB6的设置
	
	else if(pin==PORTB_Pin_6)
	{
		if ((pincmd==Input) && (pinres==High))		//PB6输入,引脚默认高电平
		{
			DDRB&=~(1<<PORTB6);				//PB6输入
			PORTB|=(1<<PORTB6);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PB6输入，引脚默认低电平
		{
			DDRB&=~(1<<PORTB6);				//PB6输入
			PORTB&=~(1<<PORTB6);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PB6输出，引脚默认高电平
		{
			DDRB|=(1<<PORTB6);				//PB6输出
			PORTB|=(1<<PORTB6);				//上拉电阻使能
		}
		
		else if((pincmd==Output) && (pinres==Low))
		{
			DDRB|=(1<<PORTB6);				//PB6输出
			PORTB&=~(1<<PORTB6);			//上拉电阻禁止
		}
	}
	
	//PB7的设置
	
	else if(pin==PORTB_Pin_7)
	{
		if ((pincmd==Input) && (pinres==High))		//PB7输入,引脚默认高电平
		{
			DDRB&=~(1<<PORTB7);				//PB7输入
			PORTB|=(1<<PORTB7);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PB7输入，引脚默认低电平
		{
			DDRB&=~(1<<PORTB7);				//PB7输入
			PORTB&=~(1<<PORTB7);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PB7输出，引脚默认高电平
		{
			DDRB|=(1<<PORTB7);				//PB7输出
			PORTB|=(1<<PORTB7);				//上拉电阻使能
		}
		
		else if((pincmd==Output) && (pinres==Low))
		{
			DDRB|=(1<<PORTB7);				//PB7输出
			PORTB&=~(1<<PORTB7);			//上拉电阻禁止
		}
	}
	
	//PC0的设置
	
	else if(pin==PORTC_Pin_0)
	{
		if ((pincmd==Input) && (pinres==High))		//PC0输入,引脚默认高电平
		{
			DDRC&=~(1<<PORTC0);				//PC0输入
			PORTC|=(1<<PORTC0);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PC0输入，引脚默认低电平
		{
			DDRC&=~(1<<PORTC0);				//PC0输入
			PORTC&=~(1<<PORTC0);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PC0输出，引脚默认高电平
		{
			DDRC|=(1<<PORTC0);				//PC0输出
			PORTC|=(1<<PORTC0);				//上拉电阻使能
		}
		
		else if((pincmd==Output) && (pinres==Low))
		{
			DDRC|=(1<<PORTC0);				//PC0输出
			PORTC&=~(1<<PORTC0);			//上拉电阻禁止
		}
	}
	
	//PC1的设置
	
	else if(pin==PORTC_Pin_1)
	{
		if ((pincmd==Input) && (pinres==High))		//PC1输入,引脚默认高电平
		{
			DDRC&=~(1<<PORTC1);				//PC1输入
			PORTC|=(1<<PORTC1);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PC1输入，引脚默认低电平
		{
			DDRC&=~(1<<PORTC1);				//PC1输入
			PORTC&=~(1<<PORTC1);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PC1输出，引脚默认高电平
		{
			DDRC|=(1<<PORTC1);				//PC1输出
			PORTC|=(1<<PORTC1);				//上拉电阻使能
		}
		
		else if((pincmd==Output) && (pinres==Low))
		{
			DDRC|=(1<<PORTC1);				//PC1输出
			PORTC&=~(1<<PORTC1);			//上拉电阻禁止
		}
	}
	
	//PC2的设置
	
	else if(pin==PORTC_Pin_2)
	{
		if ((pincmd==Input) && (pinres==High))		//PC2输入,引脚默认高电平
		{
			DDRC&=~(1<<PORTC2);				//PC2输入
			PORTC|=(1<<PORTC2);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PC2输入，引脚默认低电平
		{
			DDRC&=~(1<<PORTC2);				//PC2输入
			PORTC&=~(1<<PORTC2);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PC2输出，引脚默认高电平
		{
			DDRC|=(1<<PORTC2);				//PC2输出
			PORTC|=(1<<PORTC2);				//上拉电阻使能
		}
		
		else if((pincmd==Output) && (pinres==Low))
		{
			DDRC|=(1<<PORTC2);				//PC2输出
			PORTC&=~(1<<PORTC2);			//上拉电阻禁止
		}
	}
	
