EmbeddedKing/ATmega16/atmega16_io/atmega16_io.c
	//PC3的设置
	
	else if(pin==PORTC_Pin_3)
	{
		if ((pincmd==Input) && (pinres==High))		//PC3输入,引脚默认高电平
		{
			DDRC&=~(1<<PORTC3);				//PC3输入
			PORTC|=(1<<PORTC3);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PC3输入，引脚默认低电平
		{
			DDRC&=~(1<<PORTC3);				//PC3输入
			PORTC&=~(1<<PORTC3);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PC3输出，引脚默认高电平
		{
			DDRC|=(1<<PORTC3);				//PC3输出
			PORTC|=(1<<PORTC3);				//上拉电阻使能
		}
		
		else if((pincmd==Output) && (pinres==Low))
		{
			DDRC|=(1<<PORTC3);				//PC3输出
			PORTC&=~(1<<PORTC3);			//上拉电阻禁止
		}
	}
	
	//PC4的设置
	
	else if(pin==PORTC_Pin_4)
	{
		if ((pincmd==Input) && (pinres==High))		//PC4输入,引脚默认高电平
		{
			DDRC&=~(1<<PORTC4);				//PC4输入
			PORTC|=(1<<PORTC4);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PC4输入，引脚默认低电平
		{
			DDRC&=~(1<<PORTC4);				//PC4输入
			PORTC&=~(1<<PORTC4);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PC4输出，引脚默认高电平
		{
			DDRC|=(1<<PORTC4);				//PC4输出
			PORTC|=(1<<PORTC4);				//上拉电阻使能
		}
		
		else if((pincmd==Output) && (pinres==Low))
		{
			DDRC|=(1<<PORTC4);				//PC4输出
			PORTC&=~(1<<PORTC4);			//上拉电阻禁止
		}
	}
	
	//PC5的设置
	
	else if(pin==PORTC_Pin_5)
	{
		if ((pincmd==Input) && (pinres==High))		//PC5输入,引脚默认高电平
		{
			DDRC&=~(1<<PORTC5);				//PC5输入
			PORTC|=(1<<PORTC5);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PC5输入，引脚默认低电平
		{
			DDRC&=~(1<<PORTC5);				//PC5输入
			PORTC&=~(1<<PORTC5);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PC5输出，引脚默认高电平
		{
			DDRC|=(1<<PORTC5);				//PC5输出
			PORTC|=(1<<PORTC5);				//上拉电阻使能
		}
		
		else if((pincmd==Output) && (pinres==Low))
		{
			DDRC|=(1<<PORTC5);				//PC5输出
			PORTC&=~(1<<PORTC5);			//上拉电阻禁止
		}
	}
	
	//PC6的设置
	
	else if(pin==PORTC_Pin_6)
	{
		if ((pincmd==Input) && (pinres==High))		//PC6输入,引脚默认高电平
		{
			DDRC&=~(1<<PORTC6);				//PA0输入
			PORTC|=(1<<PORTC6);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PC6输入，引脚默认低电平
		{
			DDRC&=~(1<<PORTC6);				//PA0输入
			PORTC&=~(1<<PORTC6);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PC6输出，引脚默认高电平
		{
			DDRC|=(1<<PORTC6);				//PC6输出
			PORTC|=(1<<PORTC6);				//上拉电阻使能
		}
		
		else if((pincmd==Output) && (pinres==Low))
		{
			DDRC|=(1<<PORTC6);				//PC6输出
			PORTC&=~(1<<PORTC6);			//上拉电阻禁止
		}
	}
	
	//PC7的设置
	
	else if(pin==PORTC_Pin_7)
	{
		if ((pincmd==Input) && (pinres==High))		//PC7输入,引脚默认高电平
		{
			DDRC&=~(1<<PORTC7);				//PC7输入
			PORTC|=(1<<PORTC7);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PC7输入，引脚默认低电平
		{
			DDRC&=~(1<<PORTC7);				//PC7输入
			PORTC&=~(1<<PORTC7);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PC7输出，引脚默认高电平
		{
			DDRC|=(1<<PORTC7);				//PC7输出
			PORTC|=(1<<PORTC7);				//上拉电阻使能
		}
		
		else if((pincmd==Output) && (pinres==Low))
		{
			DDRC|=(1<<PORTC7);				//PC7输出
			PORTC&=~(1<<PORTC7);			//上拉电阻禁止
		}
	}
	
	//PD0的设置
	
	else if(pin==PORTD_Pin_0)
	{
		if ((pincmd==Input) && (pinres==High))		//PD0输入,引脚默认高电平
		{
			DDRD&=~(1<<PORTD0);				//PD0输入
			PORTD|=(1<<PORTD0);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PD0输入，引脚默认低电平
		{
			DDRD&=~(1<<PORTD0);				//PD0输入
			PORTD&=~(1<<PORTD0);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PD0输出，引脚默认高电平
		{
			DDRD|=(1<<PORTD0);				//PD0输出
			PORTD|=(1<<PORTD0);				//上拉电阻使能
		}
		
		else if((pincmd==Output) && (pinres==Low))
		{
			DDRD|=(1<<PORTD0);				//PD0输出
			PORTD&=~(1<<PORTD0);			//上拉电阻禁止
		}
	}
	
	//PD1的设置
	
	else if(pin==PORTD_Pin_1)
	{
		if ((pincmd==Input) && (pinres==High))		//PD1输入,引脚默认高电平
		{
			DDRD&=~(1<<PORTD1);				//PD1输入
			PORTD|=(1<<PORTD1);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PD1输入，引脚默认低电平
		{
			DDRD&=~(1<<PORTD1);				//PD1输入
			PORTD&=~(1<<PORTD1);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PD1输出，引脚默认高电平
		{
			DDRD|=(1<<PORTD1);				//PD1输出
			PORTD|=(1<<PORTD1);				//上拉电阻使能
		}
		
		else if((pincmd==Output) && (pinres==Low))
		{
			DDRD|=(1<<PORTD1);				//PD1输出
			PORTD&=~(1<<PORTD1);			//上拉电阻禁止
		}
	}
	
	//PD2的设置
	
	else if(pin==PORTD_Pin_2)
	{
		if ((pincmd==Input) && (pinres==High))		//PD2输入,引脚默认高电平
		{
			DDRD&=~(1<<PORTD2);				//PD2输入
			PORTD|=(1<<PORTD2);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PD2输入，引脚默认低电平
		{
			DDRD&=~(1<<PORTD2);				//PD2输入
			PORTD&=~(1<<PORTD2);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PD2输出，引脚默认高电平
		{
			DDRD|=(1<<PORTD2);				//PD2输出
			PORTD|=(1<<PORTD2);				//上拉电阻使能
		}
		
		else if((pincmd==Output) && (pinres==Low))
		{
			DDRD|=(1<<PORTD2);				//PD2输出
			PORTD&=~(1<<PORTD2);			//上拉电阻禁止
		}
	}
	
	//PD3的设置
	
	else if(pin==PORTD_Pin_3)
	{
		if ((pincmd==Input) && (pinres==High))		//PD3输入,引脚默认高电平
		{
			DDRD&=~(1<<PORTD3);				//PD3输入
			PORTD|=(1<<PORTD3);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PD3输入，引脚默认低电平
		{
			DDRD&=~(1<<PORTD3);				//PD3输入
			PORTD&=~(1<<PORTD3);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PD3输出，引脚默认高电平
		{
			DDRD|=(1<<PORTD3);				//PD3输出
			PORTD|=(1<<PORTD3);				//上拉电阻使能
		}
		
		else if((pincmd==Output) && (pinres==Low))
		{
			DDRD|=(1<<PORTD3);				//PD3输出
			PORTD&=~(1<<PORTD3);			//上拉电阻禁止
		}
	}
	
	//PD4的设置
	
	else if(pin==PORTD_Pin_4)
	{
		if ((pincmd==Input) && (pinres==High))		//PD4输入,引脚默认高电平
		{
			DDRD&=~(1<<PORTD4);				//PD4输入
			PORTD|=(1<<PORTD4);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PD4输入，引脚默认低电平
		{
			DDRD&=~(1<<PORTD4);				//PD4输入
			PORTD&=~(1<<PORTD4);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PD4输出，引脚默认高电平
		{
			DDRD|=(1<<PORTD4);				//PD4输出
			PORTD|=(1<<PORTD4);				//上拉电阻使能
		}
		
		else if((pincmd==Output) && (pinres==Low))
		{
			DDRD|=(1<<PORTD4);				//PD4输出
			PORTD&=~(1<<PORTD4);			//上拉电阻禁止
		}
	}
	
	//PD5的设置
	
	else if(pin==PORTD_Pin_5)
	{
		if ((pincmd==Input) && (pinres==High))		//PD5输入,引脚默认高电平
		{
			DDRD&=~(1<<PORTD5);				//PD5输入
			PORTD|=(1<<PORTD5);				//上拉电阻使能
		}
		
