EmbeddedKing/ATmega16/atmega16_io/atmega16_io.c
		else if ((pincmd==Input) && (pinres==Low))	//PD5输入，引脚默认低电平
		{
			DDRD&=~(1<<PORTD5);				//PD5输入
			PORTD&=~(1<<PORTD5);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PD5输出，引脚默认高电平
		{
			DDRD|=(1<<PORTD5);				//PD5输出
			PORTD|=(1<<PORTD5);				//上拉电阻使能
		}
		
		else if((pincmd==Output) && (pinres==Low))
		{
			DDRD|=(1<<PORTD5);				//PD5输出
			PORTD&=~(1<<PORTD5);			//上拉电阻禁止
		}
	}
	
	//PD6的设置
	
	else if(pin==PORTD_Pin_6)
	{
		if ((pincmd==Input) && (pinres==High))		//PD6输入,引脚默认高电平
		{
			DDRD&=~(1<<PORTD6);				//PD6输入
			PORTD|=(1<<PORTD6);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PD6输入，引脚默认低电平
		{
			DDRD&=~(1<<PORTD6);				//PD6输入
			PORTD&=~(1<<PORTD6);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PD6输出，引脚默认高电平
		{
			DDRD|=(1<<PORTD6);				//PD6输出
			PORTD|=(1<<PORTD6);				//上拉电阻使能
		}
		
		else if((pincmd==Output) && (pinres==Low))
		{
			DDRD|=(1<<PORTD6);				//PD6输出
			PORTD&=~(1<<PORTD6);			//上拉电阻禁止
		}
	}
	
	//PD7的设置
	
	else if(pin==PORTD_Pin_7)
	{
		if ((pincmd==Input) && (pinres==High))		//PD7输入,引脚默认高电平
		{
			DDRD&=~(1<<PORTD7);				//PD7输入
			PORTD|=(1<<PORTD7);				//上拉电阻使能
		}
		
		else if ((pincmd==Input) && (pinres==Low))	//PD7输入，引脚默认低电平
		{
			DDRD&=~(1<<PORTD7);				//PD7输入
			PORTD&=~(1<<PORTD7);			//上拉电阻禁止
		}
		
		else if ((pincmd==Output) && (pinres==High))	//PD7输出，引脚默认高电平
		{
			DDRD|=(1<<PORTD7);				//PD7输出
			PORTD|=(1<<PORTD7);				//上拉电阻使能
		}
		
		else if((pincmd==Output) && (pinres==Low))
		{
			DDRD|=(1<<PORTD7);				//PD7输出
			PORTD&=~(1<<PORTD7);			//上拉电阻禁止
		}
	}
}

/************************************************************************/
/*void	IO_ReadPin();													*/
/*																		*/
/*此函数用来读取引脚电平，有一个个参数									    */
/*一.pin：用来选择引脚													*/
/*																		*/
/************************************************************************/

uint8_t IO_ReadPin(Pin_Type pin)
{
	uint8_t status;
	
	//读取PA0状态
	
	if (pin==PORTA_Pin_0)
	{
		status=PINA;
		status&=1<<PINA0;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PA1状态
	
	else if (pin==PORTA_Pin_1)
	{
		status=PINA;
		status&=1<<PINA1;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PA2状态
	
	else if (pin==PORTA_Pin_2)
	{
		status=PINA;
		status&=1<<PINA2;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PA3状态
	
	else if (pin==PORTA_Pin_3)
	{
		status=PINA;
		status&=1<<PINA3;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PA4状态
	
	else if (pin==PORTA_Pin_4)
	{
		status=PINA;
		status&=1<<PINA4;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PA5状态
	
	else if (pin==PORTA_Pin_5)
	{
		status=PINA;
		status&=1<<PINA5;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PA6状态
	
	else if (pin==PORTA_Pin_6)
	{
		status=PINA;
		status&=1<<PINA6;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PA7状态
	
	else if (pin==PORTA_Pin_7)
	{
		status=PINA;
		status&=1<<PINA7;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PB0状态
	
	else if (pin==PORTB_Pin_0)
	{
		status=PINB;
		status&=1<<PINB0;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PB1状态
	
	else if (pin==PORTB_Pin_1)
	{
		status=PINB;
		status&=1<<PINB1;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PB2状态
	
	else if (pin==PORTB_Pin_2)
	{
		status=PINB;
		status&=1<<PINB2;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PB3状态
	
	else if (pin==PORTB_Pin_3)
	{
		status=PINB;
		status&=1<<PINB3;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PB4状态
	
	else if (pin==PORTB_Pin_4)
	{
		status=PINB;
		status&=1<<PINB4;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PB5状态
	
	else if (pin==PORTB_Pin_5)
	{
		status=PINB;
		status&=1<<PINB5;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PB6状态
	
	else if (pin==PORTB_Pin_6)
	{
		status=PINB;
		status&=1<<PINB6;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PB7状态
	
	else if (pin==PORTB_Pin_7)
	{
		status=PINB;
		status&=1<<PINB7;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PC0状态
	
	else if (pin==PORTC_Pin_0)
	{
		status=PINC;
		status&=1<<PINC0;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PC1状态
	
	else if (pin==PORTC_Pin_1)
	{
		status=PINC;
		status&=1<<PINC1;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PC2状态
	
	else if (pin==PORTC_Pin_2)
	{
		status=PINC;
		status&=1<<PINC2;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PC3状态
	
	else if (pin==PORTC_Pin_3)
	{
		status=PINC;
		status&=1<<PINC3;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PC4状态
	
	else if (pin==PORTC_Pin_4)
	{
		status=PINC;
		status&=1<<PINC4;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PC5状态
	
	else if (pin==PORTC_Pin_5)
	{
		status=PINC;
		status&=1<<PINC5;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PC6状态
	
	else if (pin==PORTC_Pin_6)
	{
		status=PINC;
		status&=1<<PINC6;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PC7状态
	
	else if (pin==PORTC_Pin_7)
	{
		status=PINC;
		status&=1<<PINC7;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PD0状态
	
	else if (pin==PORTD_Pin_0)
	{
		status=PIND;
		status&=1<<PIND0;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PD1状态
	
	else if (pin==PORTD_Pin_1)
	{
		status=PIND;
		status&=1<<PIND1;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PD2状态
	
	else if (pin==PORTD_Pin_2)
	{
		status=PIND;
		status&=1<<PIND2;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PD3状态
	
	else if (pin==PORTD_Pin_3)
	{
		status=PIND;
		status&=1<<PIND3;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PD4状态
	
	else if (pin==PORTD_Pin_4)
	{
		status=PIND;
		status&=1<<PIND4;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PD5状态
	
	else if (pin==PORTD_Pin_5)
	{
		status=PIND;
		status&=1<<PIND5;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PD6状态
	
	else if (pin==PORTD_Pin_6)
	{
		status=PIND;
		status&=1<<PIND6;
		if (status)
		{
			return 1;
		}
		return 0;
	}
	
	//读取PD7状态
	
