EmbeddedKing/ATmega16/atmega16_io/atmega16_io.c
	else if (pin==PORTD_Pin_7)
	{
		status=PIND;
		status&=1<<PIND7;
		if (status)
		{
			return 1;
		}
		return 0;
	}
}

void IO_PASet(Pin_Type pin,PinRes_Type pinres)
{
	if (pin==PORTA_Pin_0)
	{
		if (pinres==High)
		{
			PORTA|=(1<<PORTA0);
		}
		else if (pinres==Low)
		{
			PORTA&=~(1<<PORTA0);
		}
	}
	else if (pin==PORTA_Pin_1)
	{
		if (pinres==High)
		{
			PORTA|=(1<<PORTA1);
		}
		else if (pinres==Low)
		{
			PORTA&=~(1<<PORTA1);
		}
	}
	else if (pin==PORTA_Pin_2)
	{
		if (pinres==High)
		{
			PORTA|=(1<<PORTA2);
		}
		else if (pinres==Low)
		{
			PORTA&=~(1<<PORTA2);
		}
	}
	else if (pin==PORTA_Pin_3)
	{
		if (pinres==High)
		{
			PORTA|=(1<<PORTA3);
		}
		else if (pinres==Low)
		{
			PORTA&=~(1<<PORTA3);
		}
	}
	else if (pin==PORTA_Pin_4)
	{
		if (pinres==High)
		{
			PORTA|=(1<<PORTA4);
		}
		else if (pinres==Low)
		{
			PORTA&=~(1<<PORTA4);
		}
	}
	else if (pin==PORTA_Pin_5)
	{
		if (pinres==High)
		{
			PORTA|=(1<<PORTA5);
		}
		else if (pinres==Low)
		{
			PORTA&=~(1<<PORTA5);
		}
	}
	else if (pin==PORTA_Pin_6)
	{
		if (pinres==High)
		{
			PORTA|=(1<<PORTA6);
		}
		else if (pinres==Low)
		{
			PORTA&=~(1<<PORTA6);
		}
	}
	else if (pin==PORTA_Pin_7)
	{
		if (pinres==High)
		{
			PORTA|=(1<<PORTA7);
		}
		else if (pinres==Low)
		{
			PORTA&=~(1<<PORTA7);
		}
	}
}

void IO_PBSet(Pin_Type pin,PinRes_Type pinres)
{
	if (pin==PORTB_Pin_0)
	{
		if (pinres==High)
		{
			PORTB|=(1<<PORTB0);
		}
		else if (pinres==Low)
		{
			PORTB&=~(1<<PORTB0);
		}
	}
	
	else if (pin==PORTB_Pin_1)
	{
		if (pinres==High)
		{
			PORTB|=(1<<PORTB1);
		}
		else if (pinres==Low)
		{
			PORTB&=~(1<<PORTB1);
		}
	}
	
	else if (pin==PORTB_Pin_2)
	{
		if (pinres==High)
		{
			PORTB|=(1<<PORTB2);
		}
		else if (pinres==Low)
		{
			PORTB&=~(1<<PORTB2);
		}
	}
	
	else if (pin==PORTB_Pin_3)
	{
		if (pinres==High)
		{
			PORTB|=(1<<PORTB3);
		}
		else if (pinres==Low)
		{
			PORTB&=~(1<<PORTB3);
		}
	}
	
	else if (pin==PORTB_Pin_4)
	{
		if (pinres==High)
		{
			PORTB|=(1<<PORTB4);
		}
		else if (pinres==Low)
		{
			PORTB&=~(1<<PORTB4);
		}
	}
	
	else if (pin==PORTB_Pin_5)
	{
		if (pinres==High)
		{
			PORTB|=(1<<PORTB5);
		}
		else if (pinres==Low)
		{
			PORTB&=~(1<<PORTB5);
		}
	}
	
	else if (pin==PORTB_Pin_6)
	{
		if (pinres==High)
		{
			PORTB|=(1<<PORTB6);
		}
		else if (pinres==Low)
		{
			PORTB&=~(1<<PORTB6);
		}
	}
	
	else if (pin==PORTB_Pin_7)
	{
		if (pinres==High)
		{
			PORTB|=(1<<PORTB7);
		}
		else if (pinres==Low)
		{
			PORTB&=~(1<<PORTB7);
		}
	}
}

void IO_PCSet(Pin_Type pin,PinRes_Type pinres)
{
	if (pin==PORTC_Pin_0)
	{
		if (pinres==High)
		{
			PORTC|=(1<<PORTC0);
		}
		else if (pinres==Low)
		{
			PORTC&=~(1<<PORTC0);
		}
	}
	
	else if (pin==PORTC_Pin_1)
	{
		if (pinres==High)
		{
			PORTC|=(1<<PORTC1);
		}
		else if (pinres==Low)
		{
			PORTC&=~(1<<PORTC1);
		}
	}
	
	else if (pin==PORTC_Pin_2)
	{
		if (pinres==High)
		{
			PORTC|=(1<<PORTC2);
		}
		else if (pinres==Low)
		{
			PORTC&=~(1<<PORTC2);
		}
	}
	
	else if (pin==PORTC_Pin_3)
	{
		if (pinres==High)
		{
			PORTC|=(1<<PORTC3);
		}
		else if (pinres==Low)
		{
			PORTC&=~(1<<PORTC3);
		}
	}
	
	else if (pin==PORTC_Pin_4)
	{
		if (pinres==High)
		{
			PORTC|=(1<<PORTC4);
		}
		else if (pinres==Low)
		{
			PORTC&=~(1<<PORTC4);
		}
	}
	
	else if (pin==PORTC_Pin_5)
	{
		if (pinres==High)
		{
			PORTC|=(1<<PORTC5);
		}
		else if (pinres==Low)
		{
			PORTC&=~(1<<PORTC5);
		}
	}
	
	else if (pin==PORTC_Pin_6)
	{
		if (pinres==High)
		{
			PORTC|=(1<<PORTC6);
		}
		else if (pinres==Low)
		{
			PORTC&=~(1<<PORTC6);
		}
	}
	
	else if (pin==PORTC_Pin_7)
	{
		if (pinres==High)
		{
			PORTC|=(1<<PORTC7);
		}
		else if (pinres==Low)
		{
			PORTC&=~(1<<PORTC7);
		}
	}
}

void IO_PDSet(Pin_Type pin,PinRes_Type pinres)
{
	if (pin==PORTD_Pin_0)
	{
		if (pinres==High)
		{
			PORTD|=(1<<PORTD0);
		}
		else if (pinres==Low)
		{
			PORTD&=~(1<<PORTD0);
		}
	}
	
	else if (pin==PORTD_Pin_1)
	{
		if (pinres==High)
		{
			PORTD|=(1<<PORTD1);
		}
		else if (pinres==Low)
		{
			PORTD&=~(1<<PORTD1);
		}
	}
	
	else if (pin==PORTD_Pin_2)
	{
		if (pinres==High)
		{
			PORTD|=(1<<PORTD2);
		}
		else if (pinres==Low)
		{
			PORTD&=~(1<<PORTD2);
		}
	}
	
	else if (pin==PORTD_Pin_3)
	{
		if (pinres==High)
		{
			PORTD|=(1<<PORTD3);
		}
		else if (pinres==Low)
		{
			PORTD&=~(1<<PORTD3);
		}
	}
	
	else if (pin==PORTD_Pin_4)
	{
		if (pinres==High)
		{
			PORTD|=(1<<PORTD4);
		}
		else if (pinres==Low)
		{
			PORTD&=~(1<<PORTD4);
		}
	}
	
	else if (pin==PORTD_Pin_5)
	{
		if (pinres==High)
		{
			PORTD|=(1<<PORTD5);
		}
		else if (pinres==Low)
		{
			PORTD&=~(1<<PORTD5);
		}
	}
	
	else if (pin==PORTD_Pin_6)
	{
		if (pinres==High)
		{
			PORTD|=(1<<PORTD6);
		}
		else if (pinres==Low)
		{
			PORTD&=~(1<<PORTD6);
		}
	}
	
	else if (pin==PORTD_Pin_7)
	{
		if (pinres==High)
		{
			PORTD|=(1<<PORTD7);
		}
		else if (pinres==Low)
		{
			PORTD&=~(1<<PORTD7);
		}
	}
}
